<a href="https://colab.research.google.com/github/Na-Nazhou/DataScience/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

Create a DataFrame with **List of Lists**

In [ ]:
data = [
        ['Alex', 20, 1050],
        ['Bob', 52, 1400],
        ['Cat', 23, 1690]
]
df = pd.DataFrame(data, columns = ['name', 'age', 'salary'])
df

   name  age  salary
0  Alex   20    1050
1   Bob   52    1400
2   Cat   23    1690

Create a DataFrame with **List of Dictionaries**

In [ ]:
data = [
        {'name': 'Alex', 'age': 20, 'salary': 1050},
        {'name': 'Bob', 'age': 52, 'salary': 1400},
        {'name': 'Cat', 'age': 23, 'salary': 1690}
]
df = pd.DataFrame(data, columns = ['name', 'age', 'salary'])
df

   name  age  salary
0  Alex   20    1050
1   Bob   52    1400
2   Cat   23    1690

Create a DataFrame with **Dictionary**

In [ ]:
student = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom = ["A","A","B","A","B","B","B"]
age = [15,15,16,17,15,18,15]
score =  [80,82,95,70,67,98,85]
data = {"Student": student, "Class": classroom, "Age": age, "Score": score}
df = pd.DataFrame(data)
df

  Student Class  Age  Score
0    Anna     A   15     80
1     Bob     A   15     82
2    Cass     B   16     95
3  Darius     A   17     70
4  Eugene     B   15     67
5  Felica     B   18     98
6  Gordon     B   15     85

CSV in Python

In [ ]:
# TODO
import csv
with open('unit05-data.csv', newline='') as csvfile:
  reader = csv.reader(csvfile, delimiter=' ', quotechar='|')
  for row in reader:
    print(', '.join(row))

CSV in Pandas: **read_csv()**

In [3]:
df = pd.read_csv('unit05-data.csv')
df

          country  ... Estimated incidence (all forms) per 100 000 population
0     Afghanistan  ...                                              190.0
1     Afghanistan  ...                                              189.0
2     Afghanistan  ...                                              189.0
3     Afghanistan  ...                                              189.0
4     Afghanistan  ...                                              189.0
...           ...  ...                                                ...
3646     Zimbabwe  ...                                              355.0
3647     Zimbabwe  ...                                              304.0
3648     Zimbabwe  ...                                              278.0
3649     Zimbabwe  ...                                              242.0
3650     Zimbabwe  ...                                              208.0

[3651 rows x 7 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3651 entries, 0 to 3650
Data columns (total 7 columns):
 #   Column                                                  Non-Null Count  Dtype
---  ------                                                  --------------  -----
 0   country                                                 3651 non-null   object
 1   iso2                                                    3634 non-null   object
 2   iso3                                                    3651 non-null   object
 3   Region Code                                             3651 non-null   object
 4   year                                                    3651 non-null   int64
 5   Total Population                                        3651 non-null   int64
 6   Estimated incidence (all forms) per 100 000 population  3651 non-null   float64
dtypes: float64(1), int64(2), object(4)
memory usage: 199.8+ KB

Extracting **Row** from DataFrame: **loc[index]**

In [9]:
data = [
        {'name':'Alex','age':20,'salary':1050},
        {'name':'Bob','age':52,'salary':1400},
        {'name':'Cat','age':23,'salary':1690}
]

df = pd.DataFrame(data, columns = ['name','age','salary'])
df.loc[0]

name      Alex
age         20
salary    1050
Name: 0, dtype: object

Extracting **Column** from DataFrame

In [10]:
data = [
        {'name':'Alex','age':20,'salary':1050},
        {'name':'Bob','age':52,'salary':1400},
        {'name':'Cat','age':23,'salary':1690}
]

df = pd.DataFrame(data, columns = ['name','age','salary'])
df['name']                                                                             #or df.name but do not recommend

0    Alex
1     Bob
2     Cat
Name: name, dtype: object

Grouping & Aggregation: **groupby, agg**

In [11]:
student = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom = ["A","A","B","A","B","B","B"]
age = [15,15,16,17,15,18,15]
score =  [80,82,95,70,67,98,85]
data = {"Student": student, "Class": classroom, "Age": age,"Score": score}
df = pd.DataFrame(data)

class_score = df.groupby('Class').agg({'Score': ['mean', 'min', 'max', 'median']})
class_score

           Score
            mean min max median
Class
A      77.333333  70  82     80
B      86.250000  67  98     90

Grouping by Multiple Columns

In [13]:
student = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom = ["A","A","B","A","B","B","B"]
age = [15,15,16,17,15,18,15]
score =  [80,82,95,70,67,98,85]
data = {"Student": student, "Class": classroom, "Age": age,"Score": score}
df = pd.DataFrame(data)

class_score = df.groupby(['Class','Age']).agg({'Score': ['mean', 'min', 'max', 'median']})
class_score

          Score
           mean min max median
Class Age
A     15     81  80  82     81
      17     70  70  70     70
B     15     76  67  85     76
      16     95  95  95     95
      18     98  98  98     98

In [ ]:
# TODO
# Summarise the ages by gender and country
# Unit05-Demo53.xls

**Filtering**: Select Rows Based on Value of Column

In [15]:
df = pd.read_csv('unit05-data.csv')

# boolean expression
print(df['year'] == 2002)

year_2002 = df[(df['year'] == 2002)]
year_2002

0       False
1       False
2        True
3       False
4       False
        ...
3646    False
3647    False
3648    False
3649    False
3650    False
Name: year, Length: 3651, dtype: bool

                        country  ... Estimated incidence (all forms) per 100 000 population
2                   Afghanistan  ...                                              189.0
19                      Albania  ...                                               22.0
36                      Algeria  ...                                               74.0
53               American Samoa  ...                                                3.9
70                      Andorra  ...                                                8.2
...                         ...  ...                                                ...
3568  Wallis and Futuna Islands  ...                                              149.0
3585   West Bank and Gaza Strip  ...                                                1.9
3602                      Yemen  ...                                              102.0
3619                     Zambia  ...                                              695.0
3636                   Zimbabwe  ...                                              617.0

[213 rows x 7 columns]

Select Rows Whose Column Value Does NOT Equal a Specific Value

In [ ]:
df = pd.read_csv('unit05-data.csv')

year_not_2002 = df[(df['year'] != 2002)]
year_not_2002

Select Not Null: **notnull()**

In [ ]:
df = pd.read_csv('unit05-data.csv')

df_not_null = df[df.year.notnull()]
df_not_null

Select a list of years: **isin**

In [ ]:
df = pd.read_csv('unit05-data.csv')

years = [2002,2008]
selection = df[df.year.isin(years)]
selection

Select Rows Based on Values Not in List: **~**

In [ ]:
df = pd.read_csv('unit05-data.csv')

years = [2002,2008]
selection = df[~df.year.isin(years)]

selection

Select Rows Using Multiple Conditions: **&**

In [ ]:
df = pd.read_csv('unit05-data.csv')

years = [2002,2008]
country = ["Singapore"]
selection = df[df.year.isin(years) & df.country.isin(country)]
selection

**Demo**

In [5]:
# sum()

df = pd.read_csv('unit05-data.csv')

sg = df[(df['country'] == 'Singapore')]
sg['Estimated incidence (all forms) per 100 000 population'].sum()

700.0

In [ ]:
df = pd.read_csv('unit05-data.csv')

# Part 1
# How many cases of Tuberculosis were there in 2008 in total?
year = df[ (df['year'] == 2008)]
print(year['Estimated incidence (all forms) per 100 000 population'].sum())

# Part 2
# Find out how many cases of Tuberculosis per 100k people there
# were in Zimbabwe from 2000 to 2016
zimbabwe = df[(df['country'] == 'Zimbabwe')]
print(zimbabwe['Estimated incidence (all forms) per 100 000 population'].sum())

In [16]:
df = pd.read_csv('unit05-data.csv')

# Select Singapore’s data from years 2002 and 2008
selection = df[df.year.isin(range(2004,2009)) & df.country.isin(['Singapore'])]
print(selection)

# Select data between 2004 and 2008 that are not from Singapore
selection = df[df.year.isin(range(2004,2009)) & ~df.country.isin(['Singapore'])]
selection

        country  ... Estimated incidence (all forms) per 100 000 population
2896  Singapore  ...                                               38.0
2897  Singapore  ...                                               35.0
2898  Singapore  ...                                               33.0
2899  Singapore  ...                                               33.0
2900  Singapore  ...                                               37.0

[5 rows x 7 columns]

          country  ... Estimated incidence (all forms) per 100 000 population
4     Afghanistan  ...                                              189.0
5     Afghanistan  ...                                              189.0
6     Afghanistan  ...                                              189.0
7     Afghanistan  ...                                              189.0
8     Afghanistan  ...                                              189.0
...           ...  ...                                                ...
3638     Zimbabwe  ...                                              607.0
3639     Zimbabwe  ...                                              588.0
3640     Zimbabwe  ...                                              561.0
3641     Zimbabwe  ...                                              527.0
3642     Zimbabwe  ...                                              487.0

[1064 rows x 7 columns]

**Concatenate** DataFrames: **concat**

In [18]:
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class": classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1)
print(df1)

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class": classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2)
print(df2)

# Concatenate DataFrames by Rows
df_row = pd.concat([df1, df2], ignore_index=True)
print(df_row)

# Concatenate DataFrames by Column
df_row = pd.concat([df1, df2], ignore_index=True, axis=1)
print(df_row)

  Student Class  Age  Score
0    Anna     A   15     80
1     Bob     A   15     82
2    Cass     B   16     95
3  Darius     A   17     70
4  Eugene     B   15     67
5  Felica     B   18     98
6  Gordon     B   15     85
   Student Class  Age  Score
0  Charlie     C   16     95
1    James     C   17     77
2    Ethan     C   18     80
   Student Class  Age  Score
0     Anna     A   15     80
1      Bob     A   15     82
2     Cass     B   16     95
3   Darius     A   17     70
4   Eugene     B   15     67
5   Felica     B   18     98
6   Gordon     B   15     85
7  Charlie     C   16     95
8    James     C   17     77
9    Ethan     C   18     80
        0  1   2   3        4    5     6     7
0    Anna  A  15  80  Charlie    C  16.0  95.0
1     Bob  A  15  82    James    C  17.0  77.0
2    Cass  B  16  95    Ethan    C  18.0  80.0
3  Darius  A  17  70      NaN  NaN   NaN   NaN
4  Eugene  B  15  67      NaN  NaN   NaN   NaN
5  Felica  B  18  98      NaN  NaN   NaN   NaN
6  Gordon  B  15  85      NaN  NaN   NaN   NaN

**Merge** DataFrames: **merge**

In [20]:
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class": classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1,columns = ['Student', 'Class', 'Age', 'Score'])

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class": classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2, columns = ['Student', 'Class', 'Age', 'Score'])

df_row = pd.concat([df1, df2], ignore_index=True)
print(df_row)

student3 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon","Charlie","James","Ethan"]
id3 = [1,2,3,4,5,6,7,8,9,10]
data3 = {"Student":student3, "id":id3}
df3 = pd.DataFrame(data3, columns = ['Student', 'id'])
print(df3)

df_merge_col = pd.merge(df3, df_row, on="Student")
df_merge_col

   Student Class  Age  Score
0     Anna     A   15     80
1      Bob     A   15     82
2     Cass     B   16     95
3   Darius     A   17     70
4   Eugene     B   15     67
5   Felica     B   18     98
6   Gordon     B   15     85
7  Charlie     C   16     95
8    James     C   17     77
9    Ethan     C   18     80
   Student  id
0     Anna   1
1      Bob   2
2     Cass   3
3   Darius   4
4   Eugene   5
5   Felica   6
6   Gordon   7
7  Charlie   8
8    James   9
9    Ethan  10

   Student  id Class  Age  Score
0     Anna   1     A   15     80
1      Bob   2     A   15     82
2     Cass   3     B   16     95
3   Darius   4     A   17     70
4   Eugene   5     B   15     67
5   Felica   6     B   18     98
6   Gordon   7     B   15     85
7  Charlie   8     C   16     95
8    James   9     C   17     77
9    Ethan  10     C   18     80

**Pivoting** in Pandas: **pivot_table**

In [21]:
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class":classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1,columns = ['Student', 'Class', 'Age', 'Score'])

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class":classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2, columns = ['Student', 'Class', 'Age', 'Score'])

df_row = pd.concat([df1, df2], ignore_index=True)

student3 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon","Charlie","James","Ethan"]
id3 = [1,2,3,4,5,6,7,8,9,10]
data3 = {"Student":student3, "id":id3}
df3 = pd.DataFrame(data3,columns = ['Student', 'id'])

df_merge_col = pd.merge(df_row, df3, on="Student")
print(df_merge_col)

# By default, aggfunc = [np.mean]
df_merge_col.pivot_table(index="Class", columns="Age", values="Score", aggfunc=['max', 'min'])

   Student Class  Age  Score  id
0     Anna     A   15     80   1
1      Bob     A   15     82   2
2     Cass     B   16     95   3
3   Darius     A   17     70   4
4   Eugene     B   15     67   5
5   Felica     B   18     98   6
6   Gordon     B   15     85   7
7  Charlie     C   16     95   8
8    James     C   17     77   9
9    Ethan     C   18     80  10

        max                     min
Age      15    16    17    18    15    16    17    18
Class
A      82.0   NaN  70.0   NaN  80.0   NaN  70.0   NaN
B      85.0  95.0   NaN  98.0  67.0  95.0   NaN  98.0
C       NaN  95.0  77.0  80.0   NaN  95.0  77.0  80.0

Set Missing Values To 0: **fill_value**

In [23]:
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class":classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1,columns = ['Student', 'Class', 'Age', 'Score'])

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class":classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2, columns = ['Student', 'Class', 'Age', 'Score'])

df_row = pd.concat([df1, df2], ignore_index=True)
student3 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon","Charlie","James","Ethan"]
id3 = [1,2,3,4,5,6,7,8,9,10]

data3 = {"Student":student3, "id":id3}
df3 = pd.DataFrame(data3,columns = ['Student', 'id'])

df_merge_col = pd.merge(df_row, df3, on="Student")
print(df_merge_col)

df_merge_col.pivot_table(index="Class", columns="Age", values="Score", aggfunc=['max', 'min'], fill_value = 0)

   Student Class  Age  Score  id
0     Anna     A   15     80   1
1      Bob     A   15     82   2
2     Cass     B   16     95   3
3   Darius     A   17     70   4
4   Eugene     B   15     67   5
5   Felica     B   18     98   6
6   Gordon     B   15     85   7
7  Charlie     C   16     95   8
8    James     C   17     77   9
9    Ethan     C   18     80  10

      max             min
Age    15  16  17  18  15  16  17  18
Class
A      82   0  70   0  80   0  70   0
B      85  95   0  98  67  95   0  98
C       0  95  77  80   0  95  77  80

In [27]:
student1 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon"]
classroom1 = ["A","A","B","A","B","B","B"]
age1 = [15,15,16,17,15,18,15]
score1 =  [80,82,95,70,67,98,85]
data1 = {"Student": student1, "Class":classroom1, "Age": age1,"Score": score1}
df1 = pd.DataFrame(data1,columns = ['Student', 'Class', 'Age', 'Score'])

student2 = ["Charlie","James","Ethan"]
classroom2 = ["C","C","C"]
age2 = [16,17,18]
score2 = [95,77,80]
data2 = {"Student": student2, "Class":classroom2, "Age": age2,"Score": score2}
df2 = pd.DataFrame(data2, columns = ['Student', 'Class', 'Age', 'Score'])

df_row = pd.concat([df1, df2], ignore_index=True)
student3 = ["Anna","Bob","Cass","Darius","Eugene","Felica","Gordon","Charlie","James","Ethan"]
id3 = [1,2,3,4,5,6,7,8,9,10]

data3 = {"Student":student3, "id":id3}
df3 = pd.DataFrame(data3,columns = ['Student', 'id'])

df_merge_col = pd.merge(df_row, df3, on="Student")
print(df_merge_col)

# TODO: df.pivot()
df_merge_col.pivot(index="id", columns="Age", values="Score")

   Student Class  Age  Score  id
0     Anna     A   15     80   1
1      Bob     A   15     82   2
2     Cass     B   16     95   3
3   Darius     A   17     70   4
4   Eugene     B   15     67   5
5   Felica     B   18     98   6
6   Gordon     B   15     85   7
7  Charlie     C   16     95   8
8    James     C   17     77   9
9    Ethan     C   18     80  10

Age    15    16    17    18
id
1    80.0   NaN   NaN   NaN
2    82.0   NaN   NaN   NaN
3     NaN  95.0   NaN   NaN
4     NaN   NaN  70.0   NaN
5    67.0   NaN   NaN   NaN
6     NaN   NaN   NaN  98.0
7    85.0   NaN   NaN   NaN
8     NaN  95.0   NaN   NaN
9     NaN   NaN  77.0   NaN
10    NaN   NaN   NaN  80.0

Output DataFrame to csv: **to_csv**

In [ ]:
df_merge_col.to_csv(r'df_merge_col.csv', index=False, header=True)

Data Cleaning: **dropna**

In [28]:
df = pd.read_excel("MissingData.xls")

# Remove rows 
df = df.dropna()
print(df)

# Remove columns
df = df.dropna(axis = 1)
df

    0 First Name  Last Name  Gender        Country   Age        Date    Id
0   1      Dulce      Abril  Female  United States  32.0  15/10/2017  1562
1   2       Mara  Hashimoto  Female  Great Britain  25.0  16/08/2016  1582
5   6     Gaston      Brumm    Male  United States  24.0  21/05/2015  2554
6   7       Etta       Hurn  Female  Great Britain  56.0  15/10/2017  3598
7   8    Earlean     Melgar  Female  United States  27.0  16/08/2016  2456
8   9   Vincenza    Weiland  Female  United States  40.0  21/05/2015  6548
9  10     Fallon    Winward  Female  Great Britain  28.0  16/08/2016  5486

    0 First Name  Last Name  Gender        Country   Age        Date    Id
0   1      Dulce      Abril  Female  United States  32.0  15/10/2017  1562
1   2       Mara  Hashimoto  Female  Great Britain  25.0  16/08/2016  1582
5   6     Gaston      Brumm    Male  United States  24.0  21/05/2015  2554
6   7       Etta       Hurn  Female  Great Britain  56.0  15/10/2017  3598
7   8    Earlean     Melgar  Female  United States  27.0  16/08/2016  2456
8   9   Vincenza    Weiland  Female  United States  40.0  21/05/2015  6548
9  10     Fallon    Winward  Female  Great Britain  28.0  16/08/2016  5486

Data Imputation: **fillna**

In [29]:
df = pd.read_excel("MissingData.xls", typ = "series")

m = df.Age.mean()
df["Age"] = df["Age"].fillna(m)
df

    0 First Name  Last Name  Gender        Country        Age        Date    Id
0   1      Dulce      Abril  Female  United States  32.000000  15/10/2017  1562
1   2       Mara  Hashimoto  Female  Great Britain  25.000000  16/08/2016  1582
2   3     Philip       Gent    Male         France  33.142857  21/05/2015  2587
3   4   Kathleen     Hanner  Female  United States  33.142857  15/10/2017  3549
4   5    Nereida    Magwood  Female  United States  33.142857  16/08/2016  2468
5   6     Gaston      Brumm    Male  United States  24.000000  21/05/2015  2554
6   7       Etta       Hurn  Female  Great Britain  56.000000  15/10/2017  3598
7   8    Earlean     Melgar  Female  United States  27.000000  16/08/2016  2456
8   9   Vincenza    Weiland  Female  United States  40.000000  21/05/2015  6548
9  10     Fallon    Winward  Female  Great Britain  28.000000  16/08/2016  5486

**read_json()**

In [ ]:
json_str = '{"country":"Netherlands","timezone":"Europe\/Amsterdam","ip":"46.19.37.108","continent_code":"EU","longitude":5.75,"latitude":52.5,"country_code":"NL"}'
data = pd.read_json(json_str, typ = "series")
print("Series\n", data)

In [ ]:
json_str = '{"firstName":"Mona","lastName":"Tan","nationality":"Singapore"}'
data = pd.read_json(json_str, typ = "series")
print("My Info\n", data)

In [ ]:
df = pd.read_json('example_1.json', typ ='series')
df

**read_excel()**

In [ ]:
df = pd.read_excel("MissingData.xls")
df

In [ ]:
df = pd.read_excel('unit05_data.xls', typ = 'series')
df

In [ ]:
df = pd.read_excel('unit05_data.xls',  typ = 'series')

gender_and_country = df[(df['Gender']=='Female') & (df['Country']== "United States")]
gender_and_country

In [ ]:
df = pd.read_excel ('Unit05-Demo53.xls', typ='series')

age_and_date =  df[ (df['Age'] >= 25) & (df['Date'] == '21/05/2015') ] 
age_and_date['First Name'].count()

**XML**

In [ ]:
import xml.etree.ElementTree as ET

**XML** in Python

In [ ]:
tree = ET.parse("Unit 05 - XML Sample Data.xml")
root = tree.getroot()
for child in root:
  print(child.tag , child.attrib)

**XML** in Pandas

In [ ]:
#parsing xml file and storing in Dataframe

tree = ET.parse("Unit 05 - XML Sample Data.xml")

dfcols = ["Country", "rank", "year", "GDP"]
df_xml = pd.DataFrame(columns = dfcols)

for node in tree.getroot():
    name = node.attrib.get("name")
    rank = node.find("rank").text
    y = node.find("year").text
    gdppc = node.find("gdppc").text
    df_xml = df_xml.append(pd.Series([name,rank,y,gdppc], index = dfcols),ignore_index = True)

df_xml

Demo

In [ ]:
tree = ET.parse('breakfast_menu.xml')

dfcols = ["food", "price", "description", 'calories']
df_xml = pd.DataFrame(columns=dfcols)

for node in tree.getroot():
    name = node.find('name').text
    price = node.find('price').text
    description = node.find('description').text
    calories = node.find('calories').text
    
    df_xml = df_xml.append( pd.Series([name , price, description, calories],index=dfcols) , ignore_index =True)
    
df_xml